Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Authorize web endpoints
ja_jp: ウェブエンドポイントの認可

source: Auto Mocking Unsatisfied Dependencies
ja_jp: 満たされていない依存関係の自動モック化

source: Auto Schema Discovery
ja_jp: 自動スキーマ検出

source: Auto-deregistration on shutdown
ja_jp: シャットダウン時の自動登録解除

source: Auto-generation of Operation Id
ja_jp: 操作IDの自動生成

source: AutoConfigurations and wasted dependencies went away (big win)
ja_jp: AutoConfigurationsと無駄な依存関係がなくなりました (大勝利)

source: Automate Quarkus deployment with Ansible
ja_jp: AnsibleでQuarkusのデプロイを自動化

source: Automated and secured publishing of your Maven releases to Maven Central
ja_jp: Maven CentralへのMavenリリースの自動化された安全な配信

source: Automated cross-testing of your extension with Quarkus builds/releases
ja_jp: Quarkusのビルド/リリースを使用したエクステンションのクロステストの自動化

source: Automated cross-testing of your extension with Quarkus builds/releases (see https://github.com/quarkusio/quarkus-ecosystem-ci)
ja_jp: Quarkus のビルド/リリースを使用した、エクステンションのクロステストの自動化 (https://github.com/quarkusio/quarkus-ecosystem-ci)

source: Automated deployment (Kubernetes/OpenShift)
ja_jp: 自動デプロイメント（Kubernetes/OpenShift）

source: Automated inclusion in the upcoming Extension registry
ja_jp: 今後のエクステンションレジストリーへの自動インクルード

source: Automated migration
ja_jp: マイグレーション自動化

source: Automatic Discovery
ja_jp: オートディスカバリー

source: Automatic Failover
ja_jp: 自動フェイルオーバー

source: Automatic REST endpoint generation
ja_jp: RESTエンドポイントの自動生成

source: Automatic Service Setup with Dev Services
ja_jp: Dev Servicesでの自動サービスセットアップ

source: Automatic Table of Contents (TOC)
ja_jp: 自動目次 (TOC)

source: Automatic build time enhancement
ja_jp: 自動ビルド時間の強化

source: Automatic certificate management with Let's Encrypt
ja_jp: Let's Encrypt による証明書の自動管理

source: Automatic conversion of the configuration type, including List, Set, Map, Optional, and primitive types.
ja_jp: List、 Set、 Map、 Optional、およびプリミティブ型を含む、設定型の自動変換。

source: Automatic data initialization
ja_jp: データの自動初期化

source: Automatic datasource binding
ja_jp: 自動データソースバインディング

source: Automatic generation of pull secrets
ja_jp: プル・シークレットの自動生成

source: Automatic import script
ja_jp: 自動インポートスクリプト

source: Automatic imports
ja_jp: 自動インポート

source: Automatic instrumentation
ja_jp: 自動計装

source: Automatic integration
ja_jp: 自動統合

source: Automatic key generation
ja_jp: 自動鍵生成

source: Automatic metrics instrumentation in Quarkus is done by the xref:telemetry-micrometer.adoc[Quarkus Micrometer extension].
ja_jp: Quarkus における自動メトリクス計装は、xref:telemetry-micrometer.adoc[Quarkus Micrometer エクステンション] によって行われます。

source: Automatic metrics instrumentation in Quarkus is done by the xref:telemetry-micrometer.adoc[Quarkus Micrometer extension]. We plan to provide, in the future, a bridge for those metrics to be available in OpenTelemetry as well.
ja_jp: Quarkus の自動メトリクス計装は、xref:telemetry-micrometer.adoc[Quarkus Micrometer エクステンション] により実行されます。将来的には、これらのメトリクスを OpenTelemetry でも利用できるようにするためのブリッジを提供する予定です。

source: Automatic metrics instrumentation in Quarkus is handled by xref:telemetry-micrometer.adoc[Micrometer] and the xref:telemetry-micrometer-to-opentelemetry.adoc[quarkus-micrometer-opentelemetry] extension bridges those metrics into OpenTelemetry.
ja_jp: Quarkus における自動メトリクス計装は xref:telemetry-micrometer.adoc[Micrometer] によって処理され、xref:telemetry-micrometer-to-opentelemetry.adoc[quarkus-micrometer-opentelemetry] エクステンションはそれらのメトリクスを OpenTelemetry にブリッジします。

source: Automatic provisioning and application wiring of supporting services such as databases, identity servers, and more.
ja_jp: データベース、IDサーバーなどのサポートサービスの自動プロビジョニングとアプリケーションの接続

source: Automatic registration is enabled by default. If you want to disable registration, you can do it per service using the following property:
ja_jp: 自動登録はデフォルトで有効になっています。登録を無効にしたい場合は、以下の設定プロパティーを使用してサービスごとに設定できます。

source: Automatic repository implementation generation
ja_jp: 自動リポジトリー実装生成

source: Automatic service binding
ja_jp: 自動サービスバインディング

source: Automatic service binding can be generated for a limited number of service types. To be consistent with established terminology for Kubernetes and Quarkus services, this chapter refers to these service types as kinds.
ja_jp: 自動サービスバインディングは、限られた数のサービスタイプに対して生成することができます。Kubernetes および Quarkus のサービスに関する確立された用語と一致させるために、この章ではこれらのサービスタイプを kind と呼びます。

source: Automatic service registration with SmallRye Stork for Quarkus
ja_jp: Quarkus における SmallRye Stork を使用したサービス自動登録

source: Automatic style checking on the PR diff
ja_jp: PR diffの自動スタイルチェック

source: Automatic tracing instrumentation parts can be disabled by setting `quarkus.otel.instrument.*` properties to `false`.
ja_jp: `quarkus.otel.instrument.*` プロパティーを `false` に設定することで、自動トレーシング計装部分を無効にすることができます。

source: Automatically
ja_jp: 自動で

# Automatically add newline with `curl -w " "`
source: Automatically add newline with `curl -w "\n"`
ja_jp: `curl -w "\n"` で自動的に改行が追加されるようにします。

source: Automatically generated metrics
ja_jp: 自動的に生成されたメトリクス

source: Automatically generates a random salt for each password.
ja_jp: 各パスワードに対してランダムなソルトを自動的に生成します。

source: Automatically handles version alignment between Quarkus and Chicory’s ASM dependencies.
ja_jp: Quarkus と Chicory の ASM 依存関係間のバージョン整合性を自動的に処理します。

source: Automatically index your Hibernate entities in Elasticsearch
ja_jp: Hibernate エンティティーを Elasticsearch で自動的にインデックス

source: Automatically start database containers with Dev Services.
ja_jp: Dev Servicesでのデータベースコンテナの自動起動

source: Automatically transitioning to Flyway to Manage Schemas
ja_jp: スキーマを管理するためのFlywayへの自動移行

source: Avail. at run time
ja_jp: 実行時に利用可

source: Availability As Of
ja_jp: 現時点での可用性

source: Available APIs
ja_jp: 利用可能なAPI

source: Available Build Time Metadata
ja_jp: 利用可能なビルドタイムメタデータ

source: Available OpenTelemetry CDI injections
ja_jp: 使用可能なOpenTelemetry CDI依存関係注入

source: Available log levels:
ja_jp: 利用可能なログレベル:

source: Available on JVM?
ja_jp: JVM で利用可能？

source: Available on Native?
ja_jp: ネイティブで利用可能？

source: Available options
ja_jp: 利用可能なオプション

source: Available properties to customize the Redis Dev Service.
ja_jp: Redis Dev Service をカスタマイズするために利用可能なプロパティ

source: Available properties to customize the Redis DevService.
ja_jp: Redis DevServiceをカスタマイズするために利用可能なプロパティ.

source: Available service discovery and selection
ja_jp: 利用可能なサービスディスカバリーとセレクション

source: Avoid using errors and warnings for conditions that will not affect normal operation. These outputs can cause false alarms in user monitoring systems.
ja_jp: 通常の動作に影響しない状況では、エラーや警告を使用しないでください。これらの出力は、ユーザー監視システムで誤報を引き起こす可能性があります。

source: Avoiding duplicate registrations
ja_jp: 重複した登録の回避

source: Avoiding the use of ThreadLocals and instead by utilizing a context object that contains all the necessary information. ThreadLocals are a convenient way to make data available to different parts of a framework, but their frequent use comes at a cost and are thus fully avoided in RESTEasy Reactive.
ja_jp: ThreadLocals の使用を避け、代わりに必要な情報をすべて含むコンテキストオブジェクトを利用します。ThreadLocals はフレームワークのさまざまな部分でデータを利用できるようにする便利な方法です。ただし、その頻繁な使用にはコストがかかるため、RESTEasyReactive では完全に回避されています。

source: Avro Serialization
ja_jp: Avro シリアライゼーション

source: Avro code generation details
ja_jp: Avro コード生成の詳細

source: Avro schema
ja_jp: Avro スキーマ

source: Await completion of the consumer task.
ja_jp: コンシューマタスクの完了を待ちます。

source: Azure Deployment Descriptors
ja_jp: Azureデプロイメントディスクリプタ

source: Azure Event Hubs for Kafka is not available in the _basic_ tier. You need at least the _standard_ tier to use Kafka. See https://azure.microsoft.com/en-us/pricing/details/event-hubs/[Azure Event Hubs Pricing] to see the other options.
ja_jp: Azure Event Hubs for Kafka は、_basic_ 層では使用できません。Kafka を使用するには、少なくとも _standard_ 層が必要です。他のオプションについては、 https://azure.microsoft.com/en-us/pricing/details/event-hubs/[Azure Event Hubs Pricing] を参照してください。

source: Azure Functions (Serverless) with RESTEasy Reactive, Undertow, or Reactive Routes
ja_jp: RESTEasy、Undertow、またはVert.x Webを使用したAzure Functions (サーバーレス)

source: Azure Functions (Serverless) with RESTEasy, Undertow, or Reactive Routes
ja_jp: RESTEasy、Undertow、Reactive Routesを使ったAzure Functions（サーバーレス）

source: Azure Functions (Serverless) with Vert.x Web, Servlet, or RESTEasy
ja_jp: Vert.x Web、Servlet、またはRESTEasyを使用したAzure Functions (サーバーレス)

source: Azure Functions Configuration Reference
ja_jp: Azure Functions 設定リファレンス

source: Azure Functions extension
ja_jp: Azure Functions エクステンション

source: Azure Functions with Quarkus REST, Undertow, or Reactive Routes
ja_jp: Quarkus REST、Undertow、またはReactive Routesを使用したAzure Functions

source: Azure Functions with RESTEasy Reactive, Undertow, or Reactive Routes
ja_jp: RESTEasy Reactive、Undertow、または Reactive Routes を使用した Azure Functions

source: Back Pressure and Credits
ja_jp: バックプレッシャーとクレジット

source: Back channel logout
ja_jp: バックチャンネルログアウト

source: Back in August we started looking into enabling GitHub discussions for community conversations. Main drivers were that we felt the community were missing a place to post about all things Quarkus - not everything is a user question or a development idea for Quarkus. In additonal all the conversations in Zulip #user chat kept growing every day but every question answered are not discoverable by search engines. Yes, StackOverflow exist, but it has issues too - thus we needed something better. Enter GitHub Discussions.
ja_jp: 8月に、コミュニティの会話のためにGitHubでのディスカッションを可能にすることを検討し始めました。その主な理由は、コミュニティにはQuarkusに関するあらゆることを投稿する場所がないと感じたからです。すべてがユーザーの質問やQuarkusの開発アイデアではありません。さらに、Zulip #ユーザーチャットでの会話は毎日増え続けていましたが、回答されたすべての質問は検索エンジンで発見できません。StackOverflowもありますが、こちらも問題があります。何かより良いものを求めており、そこで登場したのが、GitHub Discussionsです。

source: Back on the `Identifiers` page, press `+`:
ja_jp: `Identifiers` ページに戻り、 `+` を押します。

source: Back on the key page, press `Continue`:
ja_jp: キーページに戻り、 `Continue` を押します。

source: Back on the service list, click on your newly created service:
ja_jp: サービスリストに戻り、新しく作成したサービスをクリックします。

source: Back to our _producer_ project. Let's modify the `QuotesResource` to consume quotes from Kafka and send them back to the client via Server-Sent Events:
ja_jp: _プロデューサー_ プロジェクトに戻ります。 `QuotesResource` を変更して、Kafka からの見積りを消費し、サーバー送信イベントを介してクライアントに送り返します。

source: Back to our _producer_ project. Let's modify the `QuotesResource` to consume quotes from Pulsar and send them back to the client via Server-Sent Events:
ja_jp: _プロデューサー_ プロジェクトに戻ります。 `QuotesResource` を変更して、Pulsarからの見積りを消費し、サーバー送信イベントを介してクライアントに送り返します。

source: Back to our `producer` project. Let's modify the `QuotesResource` to consume quotes, bind it to an HTTP endpoint to send events to clients:
ja_jp: `producer` プロジェクトに戻ります。引用符を使用するように `QuotesResource` を変更し、それを HTTP エンドポイントにバインドして、クライアントにイベントを送信しましょう。

source: Back to our application code, the REST resource is then a simple delegation layer:
ja_jp: アプリケーションコードに戻ると、REST リソースは単純な委譲レイヤーとなります。

source: Back-Channel Logout
ja_jp: バックチャンネルログアウト

source: Back-channel Logout
ja_jp: バックチャネルログアウト

source: Back-channel logout
ja_jp: バックチャネルログアウト

source: Back-channel logout path
ja_jp: バックチャネルログアウトパス

source: Back-channel logout properties
ja_jp: バックチャネルログアウトプロパティー

source: Back-channel logout should be used for complex Quarkus applications involving several services, possibly on different hosts or ports, when supporting a global logout is required. The user, by choosing to logout from one of the services, also gets logged out from all other services. The OIDC provider detects the logout request (for example, an RP-initiated one) from one of the services and sends back-channel notifications to all other Quarkus OIDC applications. See the xref:security-oidc-code-flow-authentication.adoc#back-channel-logout[OIDC Back-channel logout] section for more details.
ja_jp: バックチャネルログアウトは、複数のサービス (異なるホストまたはポート上にある可能性もあります) を含む複雑な Quarkus アプリケーションでグローバルログアウトのサポートが必要な場合に使用されます。ユーザーがサービスのいずれかからログアウトを選択すると、他のすべてのサービスからもログアウトされます。OIDC プロバイダーは、サービスのいずれかからのログアウトリクエスト (たとえば RP-initiated のもの) を検出し、他のすべての Quarkus OIDC アプリケーションにバックチャネル通知を送信します。詳細は xref:security-oidc-code-flow-authentication.adoc#back-channel-logout[OIDC バックチャネルログアウト] セクションを参照してください。

source: Back-channel logout token cache clean up interval
ja_jp: バックチャネルログアウトトークンキャッシュのクリーンアップ間隔

source: Back-channel logout token cache size
ja_jp: バックチャネルログアウトトークンキャッシュサイズ

source: Back-channel logout token cache time to live
ja_jp: バックチャネルログアウトトークンキャッシュの有効期間

source: Back-channel logout token key
ja_jp: バックチャネルログアウトトークンキー

source: Back-pressure and inflight records
ja_jp: バックプレッシャーとインフライトレコード

source: Backend integration via JSON-RPC
ja_jp: JSON-RPC によるバックエンド統合

source: Background
ja_jp: 背景

source: Background Functions - Cloud Storage
ja_jp: バックグラウンド関数 - クラウドストレージ

source: Background Functions - PubSub
ja_jp: バックグラウンド関数 - PubSub

source: Background information: There are two related mechanisms in Gradle at play to improve build performance:
ja_jp: 背景：Gradleには、ビルドのパフォーマンスを向上させるために、2つの関連するメカニズムが働いています:

source: Backpressure
ja_jp: バックプレッシャー

source: Backwards compatibility
ja_jp: 下位互換性

source: Bad example
ja_jp: 悪い例

source: Badge UI Component based on the https://vaadin.com/docs/latest/components/badge[vaadin themed] badge
ja_jp: https://vaadin.com/docs/latest/components/badge[vaadin themed] バッジに基づく Badge UI コンポーネント。

source: Baggage carried by SpanContext in the Span
ja_jp: Span 内の SpanContext によって運ばれる Baggage

source: Baggage is an independent signal propagated in parallel with the OTel Context, it's not part of it.
ja_jp: Baggage は、OTel コンテキストと並行して伝播される独立した信号であり、その一部ではありません。

source: Banned Dependencies
ja_jp: 禁止された依存関係

source: Bare library running
ja_jp: ベアライブラリの実行

source: Base ClassLoader
ja_jp: ベース ClassLoader

source: Base Runtime ClassLoader
ja_jp: ベースランタイム ClassLoader

source: Base Runtime Image for Native Executables
ja_jp: ネイティブ実行可能ファイルのためのベースランタイムイメージ

source: Base codestarts
ja_jp: ベース Codestart

source: Based on standards we were already familiar with
ja_jp: 慣れ親しんだ標準に基づいている

source: Based on the provided configuration, in the event of the default cluster becoming unavailable, the client will seamlessly transition to one of the accessible backup clusters. Additionally, there is also the option to manually switch the client to an alternate cluster:
ja_jp: 提供された設定に基づき、デフォルトクラスタが利用できなくなった場合、クライアントはアクセス可能なバックアップクラスタの1つにシームレスに移行します。さらに、クライアントを別のクラスタに手動で切り替えるオプションもあります：

source: Based on the standards and the libraries you love and use (RESTEasy, Hibernate, Netty, Eclipse Vert.x, Apache Camel...)
ja_jp: 標準ライブラリーや愛用しているライブラリ－ (RESTEasy、Hibernate、Netty、Eclipse Vert.x、Apache Camel...)

source: Based on your logging API, use one of the following MDC classes:
ja_jp: ロギング API に応じて、次のいずれかの MDC クラスを使用します。

source: Basic Authentication
ja_jp: ベーシック認証

source: Basic Authentication is a well-specified, simple challenge and response scheme that all web browsers and most web servers understand. However, there are a few limitations associated with Basic Authentication, which include:
ja_jp: Basic認証は、すべてのウェブブラウザーとほとんどのウェブサーバーが理解できる、よく規定されたシンプルなチャレンジとレスポンスのスキームです。しかし、ベーシック認証には、以下のような制限があります。

source: Basic Building Blocks
ja_jp: 基本的なビルディングブロック

source: Basic Concepts
ja_jp: 基本概念

source: Basic Dev UI
ja_jp: 基本的な Dev UI

source: Basic Example: PostgreSQL Database
ja_jp: 基本的な例: PostgreSQL データベース

source: Basic Types
ja_jp: 基本的なタイプ

source: Basic and Form Authentication Mechanisms
ja_jp: 基本認証とフォーム認証の仕組み

source: Basic and Form HTTP authentication
ja_jp: HTTPのベーシック認証とフォーム認証

source: Basic and Form HTTP-based authentication mechanisms are the core authentication mechanisms supported in Quarkus. Please see xref:security-built-in-authentication.adoc#basic-auth[Basic HTTP Authentication] and xref:security-built-in-authentication.adoc#form-auth[Form HTTP Authentication] for more information.
ja_jp: Basic HTTPベースの認証メカニズムとForm HTTPベースの認証メカニズムは、Quarkusでサポートされている主要な認証メカニズムです。詳細は、xref:security-built-in-authentication.adoc#basic-auth[Basic HTTP Authentication] および xref:security-built-in-authentication.adoc#form-auth[Form HTTP Authentication] を参照してください。

source: Basic authentication
ja_jp: Basic認証

source: Basic authentication is a well-specified, simple challenge and response scheme that all web browsers and most web servers understand.
ja_jp: Basic認証は、すべてのウェブブラウザとほとんどのウェブサーバが理解できる、よく規定された単純なチャレンジとレスポンスのスキームです。

source: Basic authentication mechanism
ja_jp: Basic 認証メカニズム

source: Basic authentication must be explicitly enabled with `quarkus.http.auth.basic=true`, if more than one authentication mechanism is used.
ja_jp: 複数の認証メカニズムを使用する場合は、 `quarkus.http.auth.basic=true` でベーシック認証を明示的に有効にする必要があります。

source: Basic authentication uses fields in the HTTP header and does not rely on HTTP cookies, session identifiers, or login pages.
ja_jp: Basic認証はHTTPヘッダーのフィールドを使用し、HTTPクッキー、セッション識別子、ログインページには依存しません。

source: Basic authentication uses fields in the HTTP header and does not require HTTP cookies, session identifiers, or login pages.
ja_jp: Basic認証は、HTTPヘッダーのフィールドを使用し、HTTPクッキー、セッション識別子、ログインページは必要ありません。

source: Basic connector
ja_jp: 基本コネクター

source: Basic example
ja_jp: 基本例

source: Basic setup
ja_jp: 基本設定

source: Basic structure of a Web component page
ja_jp: Web コンポーネントページの基本構造

source: Basic version of the Sample Greeting extension
ja_jp: サンプル Greeting エクステンションの基本バージョン

source: Basically, we need to complete the next following steps:
ja_jp: 基本的には、次のようなステップを踏む必要があります。

source: Basically: _synchronous methods default to worker threads, and asynchronous methods default to I/O threads, except if explicitly stated otherwise_. Of course, you can override the behavior using the `@Blocking` and `@NonBlocking` annotations. The `@Transactional` annotation is an exception to the default rules as it often means you are accessing blocking resources (such as an entity manager).
ja_jp: 基本的に、 _同期メソッドはワーカースレッドがデフォルトとなり、非同期メソッドはI/Oスレッドがデフォルトとなります（ただし、明示的に別の方法が指定されている場合を除く）_。もちろん、 `@Blocking` や `@NonBlocking` のアノテーションを使って、この動作をオーバーライドすることができます。 `@Transactional` アノテーションは、デフォルトのルールの例外であり、しばしばブロッキングリソース（エンティティマネージャなど）にアクセスしていることを意味します。

source: Basics about Camel and REST
ja_jp: CamelとRESTに関する基礎知識

source: Batching
ja_jp: バッチ処理

source: Batching time period of sending messages.
ja_jp: メッセージ送信のバッチ期間。

source: Be Guided Through First Application
ja_jp: 初めてのアプリケーションの作成

source: Be aware that Dev Services for Keycloak defaults to not initiating a new container if it detects an existing container labeled `quarkus-dev-service-keycloak`. It connects to this container provided the value of the `quarkus.keycloak.devservices.service-name` property matches the label's value (default `quarkus`). In such cases, expect a slightly altered output when you run the following:
ja_jp: Dev Services for Keycloak は、`quarkus-dev-service-keycloak` というラベルの付いた既存のコンテナーを検出した場合、デフォルトで新しいコンテナーを起動しないことに注意してください。 `quarkus.keycloak.devservices.service-name` プロパティーの値がラベルの値 (デフォルトは `quarkus`) と一致する場合、このコンテナーに接続します。 このような場合、以下を実行すると出力が若干変更されることがあります。

source: Be aware that enabling XA for all datasources _except one_ (and only one) is still supported through link:https://www.narayana.io/docs/project/index.html#_last_resource_commit_optimization_lrco[Last Resource Commit Optimization (LRCO)].
ja_jp: _1 つだけを除く_ すべてのデータソースに対して XA を有効にすることは、link:https://www.narayana.io/docs/project/index.html#_last_resource_commit_optimization_lrco[Last Resource Commit Optimization (LRCO)] を通じて引き続きサポートされている点に注意してください。

source: Be aware that it increases the compilation time... a lot (>10 minutes).
ja_jp: コンパイル時間がかなり長くなる (10分以上) ことに注意してください。

source: Be aware that setting the pool size too low might cause some requests to time out while waiting for a connection.
ja_jp: プールサイズを小さく設定しすぎると、接続待ちの間にタイムアウトする リクエストが出てくるかもしれないことに注意してください。

source: Be aware that starting Quarkus 1.9, auto commit is disabled by default. So you need to explicitly enable it.
ja_jp: Quarkus 1.9からは、オートコミットがデフォルトで無効になっていることに注意してください。そのため、明示的に有効にする必要があります。

source: Be aware that tenant-specific configurations can also be disabled, for example: `quarkus.oidc.tenant-a.tenant-enabled=false`.
ja_jp: テナント固有の設定も無効にできる点に注意してください (例: `quarkus.oidc.tenant-a.tenant-enabled=false`)。

source: Be aware that the route is now listening on port 80 and is no longer on port 8080.
ja_jp: ルートは80番ポートをリッスンするようになり、8080番ポートではなくなったことに注意してください。

source: Be aware, the processing must be **non-blocking** as reactive routes are invoked on the IO Thread. Otherwise, set the `type` attribute of the `@Route` annotation to `Route.HandlerType.BLOCKING`, or use the `@io.smallrye.common.annotation.Blocking` annotation.
ja_jp: Reactive Routesは IO スレッドで呼び出されるため、処理は **非ブロッキング** である必要があることに注意してください。それ以外の場合は、 `@Route` アノテーションの `type` 属性を `Route.HandlerType.BLOCKING` に設定するか、 `@io.smallrye.common.annotation.Blocking` アノテーションを使用します。

source: Be careful as this implies the results might not reflect recent changes.
ja_jp: 最近の変化を反映していない可能性があることを含意しているので注意が必要です。

source: Be careful that locks are released when the transaction ends, so the method that invokes the lock query must be annotated with the `@Transactional` annotation.
ja_jp: トランザクションが終了するとロックが解放されるため、ロッククエリーを呼び出すメソッドには `@Transactional` アノテーションを付ける必要があります。

source: Be careful that locks are released when the transaction ends, so the method that invokes the lock query must be called within a transaction.
ja_jp: トランザクションが終了するとロックが解放されるため、ロッククエリーを呼び出すメソッドはトランザクション内で呼び出す必要があることに注意してください。

source: Be careful that, by default, Elasticsearch will automatically map unknown fields (if not disabled in the index settings) by detecting their type. This can become tricky if you use log parameters (which are included by default), or if you enable MDC inclusion (disabled by default), as the first log will define the type of the message parameter (or MDC parameter) field inside the index.
ja_jp: デフォルトでは、Elasticsearch は未知のフィールド（インデックス設定で無効になっていない場合）を、そのタイプを検出して自動的にマッピングすることに注意してください。これは、ログパラメータ（デフォルトで含まれている）を使用する場合や、MDC インクルード（デフォルトでは無効）を有効にする場合、最初のログがインデックス内のメッセージパラメータ（または MDC パラメータ）フィールドのタイプを定義するため、厄介なことになる可能性があります。

source: Be careful to use the `@Transactional` annotation on the operations that modify the database, you can add the annotation at the class level for simplicity purpose.
ja_jp: データベースを変更する操作には `@Transactional` アノテーションを使用するように注意してください。わかりやすくするために、クラスレベルでアノテーションを追加することもできます。

source: Be careful while using `Method`, some of its methods can be expensive.
ja_jp: `Method` を使っている間、メソッドのいくつかは高価になることがあるため注意してください。

source: Be careful with the amount of explanation given in a tutorial. Include enough information in the tutorial to help the user determine what other resource (`howto`, `concept`, or `reference`) they should look at next.
ja_jp: チュートリアルでの説明の量に注意してください。チュートリアルには、ユーザーが次に参照すべき他のリソース (ハウツー、コンセプト、リファレンス) はどれなのかを判断する上で役立つ十分な情報を含むようにしてください。

source: Be careful with the amount of explanation given in a tutorial. Include enough information in the tutorial to help the user determine what other resource (howto, concept, or reference) they should look at next.
ja_jp: チュートリアルでの説明の量に注意してください。チュートリアルには、ユーザーが次に参照すべき他のリソース (ハウツー、コンセプト、リファレンス) はどれなのかを判断する上で役立つ十分な情報を含むようにしてください。

source: Be careful, use the `@io.quarkus.hibernate.orm.PersistenceUnit` annotation, not the JPA one.
ja_jp: JPAのアノテーションではなく、 `@io.quarkus.hibernate.orm.PersistenceUnit` アノテーションを使うことに注意してください。

source: Be careful, use the `@io.quarkus.hibernate.orm.PersistenceUnit` annotation, not the Jakarta Persistence one.
ja_jp: Jakarta Persistenceのアノテーションではなく、 `@io.quarkus.hibernate.orm.PersistenceUnit` アノテーションを使用することに注意してください。

source: Be contained in a https://github.com/quarkusio/quarkus-super-heroes[single GitHub repository^] for simplicity, but *NOT* a multi-module project.
ja_jp: 簡素化のために link:https://github.com/quarkusio/quarkus-super-heroes[単一のGitHubリポジトリ, window=_blank]に含まれているが、マルチモジュールプロジェクト *ではない* こと。

source: Be fully documented.
ja_jp: 完全に文書化されていること。

source: Be notified when the application starts
ja_jp: アプリケーションの開始時に通知される
